In [4]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [22]:

names={1: 'Sama', 2: 'Huda', 3: 'Ryan'}
s1 = pd.Series(names)
s1

1    Sama
2    Huda
3    Ryan
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [11]:
s1.index = [11, 12, 13]
s1

11    Sama
12    Huda
13    Ryan
dtype: object

## Q3: Retrieve First and second elements.

## Q4: Add duplicate elements, then remove the duplication

In [28]:
s4 = pd.Series({14: 'Huda', 15: 'Sama'})
s1 = s1.append(s4)
s1

C:\Users\hudaa\AppData\Local\Temp\ipykernel_9428\721740939.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s1 = s1.append(s4)

1     Sama
2     Huda
3     Ryan
14    Huda
15    Sama
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [42]:
data = {'ID':[11,12,13],'NAME':['huda','sama','Ryan']}
Student=pd.DataFrame(data,columns=['ID','NAME'])
Student

   ID  NAME
0  11  huda
1  12  sama
2  13  Ryan

## Q6: Read educ_figdp_1_Data.csv file

In [51]:
edu=pd.read_csv('C:/Users/hudaa/Desktop/Bootcamp/labs/lab7/Day7-Lab1-Pandas/educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references